-- MySQL dump 10.13  Distrib 8.0.42, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: mydb
-- ------------------------------------------------------
-- Server version	9.3.0

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `dishes`
--

DROP TABLE IF EXISTS `dishes`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `dishes` (
  `id` int NOT NULL AUTO_INCREMENT,
  `menu_id` int NOT NULL,
  `recipe_id` int NOT NULL,
  `name` varchar(255) NOT NULL,
  `status` enum('в ожидании','готовиться','готово') NOT NULL,
  `start_time` datetime NOT NULL,
  `end_time` datetime DEFAULT NULL,
  `price` decimal(10,2) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `fk_Dishes_menu1_idx` (`menu_id`),
  KEY `fk_Dishes_recipe1_idx` (`recipe_id`),
  CONSTRAINT `fk_Dishes_menu1` FOREIGN KEY (`menu_id`) REFERENCES `menu` (`id`),
  CONSTRAINT `fk_Dishes_recipe1` FOREIGN KEY (`recipe_id`) REFERENCES `recipe` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=56 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `dishes`
--

LOCK TABLES `dishes` WRITE;
/*!40000 ALTER TABLE `dishes` DISABLE KEYS */;
INSERT INTO `dishes` VALUES (1,1,1,'Пепперони','готово','2025-05-14 12:20:00','2025-05-14 12:25:00',450.00),(2,3,3,'Карбонара','готово','2025-05-14 12:20:00','2025-05-14 12:30:00',480.00),(3,4,4,'Картофель фри','готово','2025-05-14 12:25:00','2025-05-14 12:28:00',150.00),(4,2,2,'Маргарита','готово','2025-05-14 13:10:00','2025-05-14 13:15:00',390.00),(5,6,6,'Капучино','готово','2025-05-14 13:12:00','2025-05-14 13:14:00',120.00),(6,5,5,'Сырные палочки','готово','2025-05-14 13:13:00','2025-05-14 13:16:00',180.00),(7,7,7,'Латте','готово','2025-05-14 13:55:00','2025-05-20 23:22:05',140.00),(8,2,2,'Маргарита','готово','2025-05-14 15:40:00','2025-05-14 15:45:00',390.00),(9,1,1,'Пепперони','готово','2025-05-15 21:09:50','2025-05-20 17:15:09',450.00),(10,7,7,'Латте','готово','2025-05-15 21:09:50','2025-05-20 23:22:06',140.00),(11,8,8,'Чизкейк','готово','2025-05-15 21:09:50','2025-05-20 23:22:06',220.00),(12,7,7,'Латте','готово','2025-05-20 15:16:14','2025-05-20 17:17:54',140.00),(13,4,4,'Картофель фри','готово','2025-05-20 15:16:14','2025-05-20 23:22:06',150.00),(14,5,5,'Сырные палочки','готово','2025-05-20 15:16:14','2025-05-20 23:22:07',180.00),(15,4,4,'Картофель фри','готово','2025-05-20 15:17:29','2025-05-20 17:17:14',150.00),(16,8,8,'Чизкейк','готово','2025-05-20 15:17:29','2025-05-20 17:17:14',220.00),(17,7,7,'Латте','готово','2025-05-20 15:17:29','2025-05-20 17:17:15',140.00),(18,2,2,'Маргарита','готово','2025-05-20 15:17:29','2025-05-20 17:17:15',390.00),(19,8,8,'Чизкейк','готово','2025-05-23 14:49:36','2025-05-23 14:50:38',220.00),(20,2,2,'Маргарита','готово','2025-05-23 14:49:36','2025-05-23 14:52:25',390.00),(21,5,5,'Сырные палочки','готово','2025-05-23 14:49:36','2025-05-23 14:52:47',180.00),(22,4,4,'Картофель фри','готово','2025-05-23 14:50:01','2025-05-23 14:52:49',150.00),(23,7,7,'Латте','готово','2025-05-23 14:50:01','2025-05-23 14:52:58',140.00),(24,4,4,'Картофель фри','готово','2025-05-23 14:55:02','2025-05-23 14:58:01',150.00),(25,6,6,'Капучино','готово','2025-05-23 14:55:02','2025-05-23 14:58:12',120.00),(26,1,1,'Пепперони','готово','2025-05-23 17:01:32','2025-05-23 17:03:51',450.00),(27,4,4,'Картофель фри','готово','2025-05-23 17:01:32','2025-05-23 17:03:57',150.00),(28,4,4,'Картофель фри','готово','2025-05-23 17:01:32','2025-05-23 17:04:14',150.00),(39,8,8,'Чизкейк','готово','2025-05-24 11:51:25','2025-05-24 11:56:36',220.00),(40,8,8,'Чизкейк','готово','2025-05-24 11:51:25','2025-05-24 11:56:37',220.00),(41,8,8,'Чизкейк','готово','2025-05-24 11:55:43','2025-05-24 11:56:38',220.00),(42,2,2,'Маргарита','готово','2025-05-24 11:55:43','2025-05-24 11:59:49',390.00),(43,6,6,'Капучино','готово','2025-05-24 11:55:53','2025-05-24 11:59:49',120.00),(44,5,5,'Сырные палочки','готово','2025-05-24 11:55:53','2025-05-24 11:59:49',180.00),(45,5,5,'Сырные палочки','готово','2025-05-24 11:55:53','2025-05-24 11:59:49',180.00),(46,4,4,'Картофель фри','готово','2025-05-24 11:55:53','2025-05-24 11:59:50',150.00),(47,7,7,'Латте','готово','2025-05-28 11:16:43','2025-05-28 11:18:14',140.00),(48,3,3,'Карбонара','готово','2025-05-28 11:16:43','2025-05-28 11:19:24',480.00),(49,8,8,'Чизкейк','готово','2025-05-28 11:16:55','2025-05-28 11:19:24',220.00),(50,6,6,'Капучино','готово','2025-05-28 11:16:55','2025-05-28 11:18:15',120.00),(51,4,4,'Картофель фри','готово','2025-05-28 11:16:55','2025-05-28 11:19:25',150.00),(52,1,1,'Пепперони','готово','2025-05-28 11:17:10','2025-05-28 11:19:25',450.00),(53,4,4,'Картофель фри','готово','2025-05-28 11:17:10','2025-05-28 11:19:25',150.00),(54,4,4,'Картофель фри','готово','2025-05-28 11:17:10','2025-05-28 11:19:26',150.00),(55,6,6,'Капучино','готово','2025-05-28 11:17:10','2025-05-28 11:18:16',120.00);
/*!40000 ALTER TABLE `dishes` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-06-03 10:32:55
